FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
/**
 * @brief SPIS_TXD [TXD] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) TXD data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transmitted in last granted transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIS_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWI_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL                                         */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA                                         */
    } TWI_PSEL_Type;                            /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIM_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL signal                                  */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA signal                                  */
    } TWIM_PSEL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIM_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIM_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIM_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIM_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIS_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL signal                                  */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA signal                                  */
    } TWIS_PSEL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIS_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) RXD Data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in RXD buffer                      */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last RXD transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIS_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIS_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) TXD Data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in TXD buffer                      */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last TXD transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIS_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief QDEC_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t LED;                     /*!< (@ 0x00000000) Pin select for LED signal                                  */
        __IOM uint32_t A;                       /*!< (@ 0x00000004) Pin select for A signal                                    */
        __IOM uint32_t B;                       /*!< (@ 0x00000008) Pin select for B signal                                    */
    } QDEC_PSEL_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief ACL_ACL [ACL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t ADDR;                    /*!< (@ 0x00000000) Description cluster: Start address of region
                                                 *                  to protect. The start address must be word-aligned.        */
        __IOM uint32_t SIZE;                    /*!< (@ 0x00000004) Description cluster: Size of region to protect
                                                 *                  counting from address ACL[n].ADDR. Writing
                                                 *                  a '0' has no effect.                                       */
        __IOM uint32_t PERM;                    /*!< (@ 0x00000008) Description cluster: Access permissions for region
                                                 *                  n as defined by start address ACL[n].ADDR
                                                 *                  and size ACL[n].SIZE                                       */
        __IM uint32_t RESERVED;
    } ACL_ACL_Type;                             /*!< Size = 16 (0x10)                                                          */


/**
 * @brief PPI_TASKS_CHG [TASKS_CHG] (Channel group tasks)
 */
    typedef struct
    {
        __OM uint32_t EN;                       /*!< (@ 0x00000000) Description cluster: Enable channel group n                */
        __OM uint32_t DIS;                      /*!< (@ 0x00000004) Description cluster: Disable channel group n               */
    } PPI_TASKS_CHG_Type;                       /*!< Size = 8 (0x8)                                                            */


/**
 * @brief PPI_CH [CH] (PPI Channel)
 */
    typedef struct
    {
        __IOM uint32_t EEP;                     /*!< (@ 0x00000000) Description cluster: Channel n event endpoint              */
        __IOM uint32_t TEP;                     /*!< (@ 0x00000004) Description cluster: Channel n task endpoint               */
    } PPI_CH_Type;                              /*!< Size = 8 (0x8)                                                            */


/**
 * @brief PPI_FORK [FORK] (Fork)
 */
    typedef struct
    {
        __IOM uint32_t TEP;                     /*!< (@ 0x00000000) Description cluster: Channel n task endpoint               */
    } PPI_FORK_Type;                            /*!< Size = 4 (0x4)                                                            */


/**
 * @brief USBD_HALTED [HALTED] (Unspecified)
 */
    typedef struct
    {
        __IM uint32_t EPIN[ 8 ];                /*!< (@ 0x00000000) Description collection: IN endpoint halted status.
                                                 *                  Can be used as is as response to a GetStatus()
                                                 *                  request to endpoint.                                       */
        __IM uint32_t RESERVED;
        __IM uint32_t EPOUT[ 8 ];               /*!< (@ 0x00000024) Description collection: OUT endpoint halted status.
                                                 *                  Can be used as is as response to a GetStatus()
                                                 *                  request to endpoint.                                       */
    } USBD_HALTED_Type;                         /*!< Size = 68 (0x44)                                                          */


/**
 * @brief USBD_SIZE [SIZE] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t EPOUT[ 8 ];              /*!< (@ 0x00000000) Description collection: Number of bytes received
                                                 *                  last in the data stage of this OUT endpoint                */
        __IM uint32_t ISOOUT;                   /*!< (@ 0x00000020) Number of bytes received last on this ISO OUT
                                                 *                  data endpoint                                              */
    } USBD_SIZE_Type;                           /*!< Size = 36 (0x24)                                                          */


/**
 * @brief USBD_EPIN [EPIN] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Description cluster: Data pointer                          */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Description cluster: Maximum number of bytes
                                                 *                  to transfer                                                */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Description cluster: Number of bytes transferred
                                                 *                  in the last transaction                                    */
        __IM uint32_t RESERVED[ 2 ];
    } USBD_EPIN_Type;                           /*!< Size = 20 (0x14)                                                          */


/**
 * @brief USBD_ISOIN [ISOIN] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes to transfer                        */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
    } USBD_ISOIN_Type;                          /*!< Size = 12 (0xc)                                                           */


/**
 * @brief USBD_EPOUT [EPOUT] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Description cluster: Data pointer                          */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Description cluster: Maximum number of bytes
                                                 *                  to transfer                                                */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Description cluster: Number of bytes transferred
                                                 *                  in the last transaction                                    */
        __IM uint32_t RESERVED[ 2 ];
    } USBD_EPOUT_Type;                          /*!< Size = 20 (0x14)                                                          */


/**
 * @brief USBD_ISOOUT [ISOOUT] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes to transfer                        */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
    } USBD_ISOOUT_Type;                         /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
 * @{
 */



/* =========================================================================================================================== */
/* ================                                           FICR                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Factory information configuration registers (FICR)
 */

    typedef struct                              /*!< (@ 0x10000000) FICR Structure                                             */
    {
        __IM uint32_t RESERVED[ 4 ];
        __IM uint32_t CODEPAGESIZE;             /*!< (@ 0x00000010) Code memory page size                                      */
        __IM uint32_t CODESIZE;                 /*!< (@ 0x00000014) Code memory size                                           */
        __IM uint32_t RESERVED1[ 18 ];
        __IM uint32_t DEVICEID[ 2 ];            /*!< (@ 0x00000060) Description collection: Device identifier                  */
        __IM uint32_t RESERVED2[ 6 ];
        __IM uint32_t ER[ 4 ];                  /*!< (@ 0x00000080) Description collection: Encryption root, word
                                                 *                  n                                                          */
        __IM uint32_t IR[ 4 ];                  /*!< (@ 0x00000090) Description collection: Identity Root, word n              */
        __IM uint32_t DEVICEADDRTYPE;           /*!< (@ 0x000000A0) Device address type                                        */
        __IM uint32_t DEVICEADDR[ 2 ];          /*!< (@ 0x000000A4) Description collection: Device address n                   */
        __IM uint32_t RESERVED3[ 21 ];
        __IM FICR_INFO_Type INFO;               /*!< (@ 0x00000100) Device info                                                */
        __IM uint32_t RESERVED4[ 143 ];
        __IM uint32_t PRODTEST[ 3 ];            /*!< (@ 0x00000350) Description collection: Production test signature
                                                 *                  n                                                          */
        __IM uint32_t RESERVED5[ 42 ];
        __IM FICR_TEMP_Type TEMP;               /*!< (@ 0x00000404) Registers storing factory TEMP module linearization
                                                 *                  coefficients                                               */
    } NRF_FICR_Type;                            /*!< Size = 1096 (0x448)                                                       */



/* =========================================================================================================================== */
/* ================                                           UICR                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief User information configuration registers (UICR)
 */

    typedef struct                              /*!< (@ 0x10001000) UICR Structure                                             */
    {
        __IM uint32_t RESERVED[ 5 ];
        __IOM uint32_t NRFFW[ 13 ];             /*!< (@ 0x00000014) Description collection: Reserved for Nordic firmware
                                                 *                  design                                                     */
        __IM uint32_t RESERVED1[ 2 ];
        __IOM uint32_t NRFHW[ 12 ];             /*!< (@ 0x00000050) Description collection: Reserved for Nordic hardware
                                                 *                  design                                                     */
        __IOM uint32_t CUSTOMER[ 32 ];          /*!< (@ 0x00000080) Description collection: Reserved for customer              */
        __IM uint32_t RESERVED2[ 64 ];
        __IOM uint32_t PSELRESET[ 2 ];          /*!< (@ 0x00000200) Description collection: Mapping of the nRESET
                                                 *                  function (see POWER chapter for details)                   */
        __IOM uint32_t APPROTECT;               /*!< (@ 0x00000208) Access port protection                                     */
        __IM uint32_t RESERVED3;
        __IOM uint32_t DEBUGCTRL;               /*!< (@ 0x00000210) Processor debug control                                    */
        __IM uint32_t RESERVED4[ 60 ];
        __IOM uint32_t REGOUT0;                 /*!< (@ 0x00000304) Output voltage from REG0 regulator stage. The
                                                 *                  maximum output voltage from this stage is
                                                 *                  given as VDDH - V_VDDH-VDD.                                */
    } NRF_UICR_Type;                            /*!< Size = 776 (0x308)                                                        */



/* =========================================================================================================================== */
/* ================                                         APPROTECT                                         ================ */
/* =========================================================================================================================== */


/**
 * @brief Access Port Protection (APPROTECT)
 */

    typedef struct                              /*!< (@ 0x40000000) APPROTECT Structure                                        */
    {
        __IM uint32_t RESERVED[ 340 ];
        __IOM uint32_t FORCEPROTECT;            /*!< (@ 0x00000550) Software force enable APPROTECT mechanism until
                                                 *                  next reset.                                                */
        __IM uint32_t RESERVED1;
        __IOM uint32_t DISABLE;                 /*!< (@ 0x00000558) Software disable APPROTECT mechanism                       */
    } NRF_APPROTECT_Type;                       /*!< Size = 1372 (0x55c)                                                       */



/* =========================================================================================================================== */
/* ================                                           CLOCK                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Clock control (CLOCK)
 */

