FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
    typedef struct                              /*!< (@ 0x40000000) CLOCK Structure                                            */
    {
        __OM uint32_t TASKS_HFCLKSTART;         /*!< (@ 0x00000000) Start HFXO crystal oscillator                              */
        __OM uint32_t TASKS_HFCLKSTOP;          /*!< (@ 0x00000004) Stop HFXO crystal oscillator                               */
        __OM uint32_t TASKS_LFCLKSTART;         /*!< (@ 0x00000008) Start LFCLK                                                */
        __OM uint32_t TASKS_LFCLKSTOP;          /*!< (@ 0x0000000C) Stop LFCLK                                                 */
        __OM uint32_t TASKS_CAL;                /*!< (@ 0x00000010) Start calibration of LFRC                                  */
        __OM uint32_t TASKS_CTSTART;            /*!< (@ 0x00000014) Start calibration timer                                    */
        __OM uint32_t TASKS_CTSTOP;             /*!< (@ 0x00000018) Stop calibration timer                                     */
        __IM uint32_t RESERVED[ 57 ];
        __IOM uint32_t EVENTS_HFCLKSTARTED;     /*!< (@ 0x00000100) HFXO crystal oscillator started                            */
        __IOM uint32_t EVENTS_LFCLKSTARTED;     /*!< (@ 0x00000104) LFCLK started                                              */
        __IM uint32_t RESERVED1;
        __IOM uint32_t EVENTS_DONE;             /*!< (@ 0x0000010C) Calibration of LFRC completed                              */
        __IOM uint32_t EVENTS_CTTO;             /*!< (@ 0x00000110) Calibration timer timeout                                  */
        __IM uint32_t RESERVED2[ 5 ];
        __IOM uint32_t EVENTS_CTSTARTED;        /*!< (@ 0x00000128) Calibration timer has been started and is ready
                                                 *                  to process new tasks                                       */
        __IOM uint32_t EVENTS_CTSTOPPED;        /*!< (@ 0x0000012C) Calibration timer has been stopped and is ready
                                                 *                  to process new tasks                                       */
        __IM uint32_t RESERVED3[ 117 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 63 ];
        __IM uint32_t HFCLKRUN;                 /*!< (@ 0x00000408) Status indicating that HFCLKSTART task has been
                                                 *                  triggered                                                  */
        __IM uint32_t HFCLKSTAT;                /*!< (@ 0x0000040C) HFCLK status                                               */
        __IM uint32_t RESERVED5;
        __IM uint32_t LFCLKRUN;                 /*!< (@ 0x00000414) Status indicating that LFCLKSTART task has been
                                                 *                  triggered                                                  */
        __IM uint32_t LFCLKSTAT;                /*!< (@ 0x00000418) LFCLK status                                               */
        __IM uint32_t LFCLKSRCCOPY;             /*!< (@ 0x0000041C) Copy of LFCLKSRC register, set when LFCLKSTART
                                                 *                  task was triggered                                         */
        __IM uint32_t RESERVED6[ 62 ];
        __IOM uint32_t LFCLKSRC;                /*!< (@ 0x00000518) Clock source for the LFCLK                                 */
        __IM uint32_t RESERVED7[ 3 ];
        __IOM uint32_t HFXODEBOUNCE;            /*!< (@ 0x00000528) HFXO debounce time. The HFXO is started by triggering
                                                 *                  the TASKS_HFCLKSTART task.                                 */
        __IOM uint32_t LFXODEBOUNCE;            /*!< (@ 0x0000052C) LFXO debounce time. The LFXO is started by triggering
                                                 *                  the TASKS_LFCLKSTART task when the LFCLKSRC
                                                 *                  register is configured for Xtal.                           */
        __IM uint32_t RESERVED8[ 2 ];
        __IOM uint32_t CTIV;                    /*!< (@ 0x00000538) Calibration timer interval                                 */
    } NRF_CLOCK_Type;                           /*!< Size = 1340 (0x53c)                                                       */



/* =========================================================================================================================== */
/* ================                                           POWER                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Power control (POWER)
 */

    typedef struct                              /*!< (@ 0x40000000) POWER Structure                                            */
    {
        __IM uint32_t RESERVED[ 30 ];
        __OM uint32_t TASKS_CONSTLAT;           /*!< (@ 0x00000078) Enable Constant Latency mode                               */
        __OM uint32_t TASKS_LOWPWR;             /*!< (@ 0x0000007C) Enable Low-power mode (variable latency)                   */
        __IM uint32_t RESERVED1[ 34 ];
        __IOM uint32_t EVENTS_POFWARN;          /*!< (@ 0x00000108) Power failure warning                                      */
        __IM uint32_t RESERVED2[ 2 ];
        __IOM uint32_t EVENTS_SLEEPENTER;       /*!< (@ 0x00000114) CPU entered WFI/WFE sleep                                  */
        __IOM uint32_t EVENTS_SLEEPEXIT;        /*!< (@ 0x00000118) CPU exited WFI/WFE sleep                                   */
        __IOM uint32_t EVENTS_USBDETECTED;      /*!< (@ 0x0000011C) Voltage supply detected on VBUS                            */
        __IOM uint32_t EVENTS_USBREMOVED;       /*!< (@ 0x00000120) Voltage supply removed from VBUS                           */
        __IOM uint32_t EVENTS_USBPWRRDY;        /*!< (@ 0x00000124) USB 3.3 V supply ready                                     */
        __IM uint32_t RESERVED3[ 119 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 61 ];
        __IOM uint32_t RESETREAS;               /*!< (@ 0x00000400) Reset reason                                               */
        __IM uint32_t RESERVED5[ 9 ];
        __IM uint32_t RAMSTATUS;                /*!< (@ 0x00000428) Deprecated register - RAM status register                  */
        __IM uint32_t RESERVED6[ 3 ];
        __IM uint32_t USBREGSTATUS;             /*!< (@ 0x00000438) USB supply status                                          */
        __IM uint32_t RESERVED7[ 49 ];
        __OM uint32_t SYSTEMOFF;                /*!< (@ 0x00000500) System OFF register                                        */
        __IM uint32_t RESERVED8[ 3 ];
        __IOM uint32_t POFCON;                  /*!< (@ 0x00000510) Power-fail comparator configuration                        */
        __IM uint32_t RESERVED9[ 2 ];
        __IOM uint32_t GPREGRET;                /*!< (@ 0x0000051C) General purpose retention register                         */
        __IOM uint32_t GPREGRET2;               /*!< (@ 0x00000520) General purpose retention register                         */
        __IM uint32_t RESERVED10[ 21 ];
        __IOM uint32_t DCDCEN;                  /*!< (@ 0x00000578) Enable DC/DC converter for REG1 stage                      */
        __IM uint32_t RESERVED11[ 49 ];
        __IM uint32_t MAINREGSTATUS;            /*!< (@ 0x00000640) Main supply status                                         */
        __IM uint32_t RESERVED12[ 175 ];
        __IOM POWER_RAM_Type RAM[ 4 ];          /*!< (@ 0x00000900) Unspecified                                                */
    } NRF_POWER_Type;                           /*!< Size = 2368 (0x940)                                                       */



/* =========================================================================================================================== */
/* ================                                            P0                                             ================ */
/* =========================================================================================================================== */


/**
 * @brief GPIO Port 1 (P0)
 */

    typedef struct                              /*!< (@ 0x50000000) P0 Structure                                               */
    {
        __IM uint32_t RESERVED[ 321 ];
        __IOM uint32_t OUT;                     /*!< (@ 0x00000504) Write GPIO port                                            */
        __IOM uint32_t OUTSET;                  /*!< (@ 0x00000508) Set individual bits in GPIO port                           */
        __IOM uint32_t OUTCLR;                  /*!< (@ 0x0000050C) Clear individual bits in GPIO port                         */
        __IM uint32_t IN;                       /*!< (@ 0x00000510) Read GPIO port                                             */
        __IOM uint32_t DIR;                     /*!< (@ 0x00000514) Direction of GPIO pins                                     */
        __IOM uint32_t DIRSET;                  /*!< (@ 0x00000518) DIR set register                                           */
        __IOM uint32_t DIRCLR;                  /*!< (@ 0x0000051C) DIR clear register                                         */
        __IOM uint32_t LATCH;                   /*!< (@ 0x00000520) Latch register indicating what GPIO pins that
                                                 *                  have met the criteria set in the PIN_CNF[n].SENSE
                                                 *                  registers                                                  */
        __IOM uint32_t DETECTMODE;              /*!< (@ 0x00000524) Select between default DETECT signal behavior
                                                 *                  and LDETECT mode                                           */
        __IM uint32_t RESERVED1[ 118 ];
        __IOM uint32_t PIN_CNF[ 32 ];           /*!< (@ 0x00000700) Description collection: Configuration of GPIO
                                                 *                  pins                                                       */
    } NRF_GPIO_Type;                            /*!< Size = 1920 (0x780)                                                       */



/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief 2.4 GHz radio (RADIO)
 */

