FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
    typedef struct                              /*!< (@ 0x40001000) RADIO Structure                                            */
    {
        __OM uint32_t TASKS_TXEN;               /*!< (@ 0x00000000) Enable RADIO in TX mode                                    */
        __OM uint32_t TASKS_RXEN;               /*!< (@ 0x00000004) Enable RADIO in RX mode                                    */
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000008) Start RADIO                                                */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x0000000C) Stop RADIO                                                 */
        __OM uint32_t TASKS_DISABLE;            /*!< (@ 0x00000010) Disable RADIO                                              */
        __OM uint32_t TASKS_RSSISTART;          /*!< (@ 0x00000014) Start the RSSI and take one single sample of
                                                 *                  the receive signal strength                                */
        __OM uint32_t TASKS_RSSISTOP;           /*!< (@ 0x00000018) Stop the RSSI measurement                                  */
        __OM uint32_t TASKS_BCSTART;            /*!< (@ 0x0000001C) Start the bit counter                                      */
        __OM uint32_t TASKS_BCSTOP;             /*!< (@ 0x00000020) Stop the bit counter                                       */
        __OM uint32_t TASKS_EDSTART;            /*!< (@ 0x00000024) Start the energy detect measurement used in IEEE
                                                 *                  802.15.4 mode                                              */
        __OM uint32_t TASKS_EDSTOP;             /*!< (@ 0x00000028) Stop the energy detect measurement                         */
        __OM uint32_t TASKS_CCASTART;           /*!< (@ 0x0000002C) Start the clear channel assessment used in IEEE
                                                 *                  802.15.4 mode                                              */
        __OM uint32_t TASKS_CCASTOP;            /*!< (@ 0x00000030) Stop the clear channel assessment                          */
        __IM uint32_t RESERVED[ 51 ];
        __IOM uint32_t EVENTS_READY;            /*!< (@ 0x00000100) RADIO has ramped up and is ready to be started             */
        __IOM uint32_t EVENTS_ADDRESS;          /*!< (@ 0x00000104) Address sent or received                                   */
        __IOM uint32_t EVENTS_PAYLOAD;          /*!< (@ 0x00000108) Packet payload sent or received                            */
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x0000010C) Packet sent or received                                    */
        __IOM uint32_t EVENTS_DISABLED;         /*!< (@ 0x00000110) RADIO has been disabled                                    */
        __IOM uint32_t EVENTS_DEVMATCH;         /*!< (@ 0x00000114) A device address match occurred on the last received
                                                 *                  packet                                                     */
        __IOM uint32_t EVENTS_DEVMISS;          /*!< (@ 0x00000118) No device address match occurred on the last
                                                 *                  received packet                                            */
        __IOM uint32_t EVENTS_RSSIEND;          /*!< (@ 0x0000011C) Sampling of receive signal strength complete               */
        __IM uint32_t RESERVED1[ 2 ];
        __IOM uint32_t EVENTS_BCMATCH;          /*!< (@ 0x00000128) Bit counter reached bit count value                        */
        __IM uint32_t RESERVED2;
        __IOM uint32_t EVENTS_CRCOK;            /*!< (@ 0x00000130) Packet received with CRC ok                                */
        __IOM uint32_t EVENTS_CRCERROR;         /*!< (@ 0x00000134) Packet received with CRC error                             */
        __IOM uint32_t EVENTS_FRAMESTART;       /*!< (@ 0x00000138) IEEE 802.15.4 length field received                        */
        __IOM uint32_t EVENTS_EDEND;            /*!< (@ 0x0000013C) Sampling of energy detection complete. A new
                                                 *                  ED sample is ready for readout from the
                                                 *                  RADIO.EDSAMPLE register.                                   */
        __IOM uint32_t EVENTS_EDSTOPPED;        /*!< (@ 0x00000140) The sampling of energy detection has stopped               */
        __IOM uint32_t EVENTS_CCAIDLE;          /*!< (@ 0x00000144) Wireless medium in idle - clear to send                    */
        __IOM uint32_t EVENTS_CCABUSY;          /*!< (@ 0x00000148) Wireless medium busy - do not send                         */
        __IOM uint32_t EVENTS_CCASTOPPED;       /*!< (@ 0x0000014C) The CCA has stopped                                        */
        __IOM uint32_t EVENTS_RATEBOOST;        /*!< (@ 0x00000150) Ble_LR CI field received, receive mode is changed
                                                 *                  from Ble_LR125Kbit to Ble_LR500Kbit.                       */
        __IOM uint32_t EVENTS_TXREADY;          /*!< (@ 0x00000154) RADIO has ramped up and is ready to be started
                                                 *                  TX path                                                    */
        __IOM uint32_t EVENTS_RXREADY;          /*!< (@ 0x00000158) RADIO has ramped up and is ready to be started
                                                 *                  RX path                                                    */
        __IOM uint32_t EVENTS_MHRMATCH;         /*!< (@ 0x0000015C) MAC header match found                                     */
        __IM uint32_t RESERVED3[ 2 ];
        __IOM uint32_t EVENTS_SYNC;             /*!< (@ 0x00000168) Preamble indicator                                         */
        __IOM uint32_t EVENTS_PHYEND;           /*!< (@ 0x0000016C) Generated when last bit is sent on air, or received
                                                 *                  from air                                                   */
        __IOM uint32_t EVENTS_CTEPRESENT;       /*!< (@ 0x00000170) CTE is present (early warning right after receiving
                                                 *                  CTEInfo byte)                                              */
        __IM uint32_t RESERVED4[ 35 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED5[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED6[ 61 ];
        __IM uint32_t CRCSTATUS;                /*!< (@ 0x00000400) CRC status                                                 */
        __IM uint32_t RESERVED7;
        __IM uint32_t RXMATCH;                  /*!< (@ 0x00000408) Received address                                           */
        __IM uint32_t RXCRC;                    /*!< (@ 0x0000040C) CRC field of previously received packet                    */
        __IM uint32_t DAI;                      /*!< (@ 0x00000410) Device address match index                                 */
        __IM uint32_t PDUSTAT;                  /*!< (@ 0x00000414) Payload status                                             */
        __IM uint32_t RESERVED8[ 13 ];
        __IM uint32_t CTESTATUS;                /*!< (@ 0x0000044C) CTEInfo parsed from received packet                        */
        __IM uint32_t RESERVED9[ 2 ];
        __IM uint32_t DFESTATUS;                /*!< (@ 0x00000458) DFE status information                                     */
        __IM uint32_t RESERVED10[ 42 ];
        __IOM uint32_t PACKETPTR;               /*!< (@ 0x00000504) Packet pointer                                             */
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000508) Frequency                                                  */
        __IOM uint32_t TXPOWER;                 /*!< (@ 0x0000050C) Output power                                               */
        __IOM uint32_t MODE;                    /*!< (@ 0x00000510) Data rate and modulation                                   */
        __IOM uint32_t PCNF0;                   /*!< (@ 0x00000514) Packet configuration register 0                            */
        __IOM uint32_t PCNF1;                   /*!< (@ 0x00000518) Packet configuration register 1                            */
        __IOM uint32_t BASE0;                   /*!< (@ 0x0000051C) Base address 0                                             */
        __IOM uint32_t BASE1;                   /*!< (@ 0x00000520) Base address 1                                             */
        __IOM uint32_t PREFIX0;                 /*!< (@ 0x00000524) Prefixes bytes for logical addresses 0-3                   */
        __IOM uint32_t PREFIX1;                 /*!< (@ 0x00000528) Prefixes bytes for logical addresses 4-7                   */
        __IOM uint32_t TXADDRESS;               /*!< (@ 0x0000052C) Transmit address select                                    */
        __IOM uint32_t RXADDRESSES;             /*!< (@ 0x00000530) Receive address select                                     */
        __IOM uint32_t CRCCNF;                  /*!< (@ 0x00000534) CRC configuration                                          */
        __IOM uint32_t CRCPOLY;                 /*!< (@ 0x00000538) CRC polynomial                                             */
        __IOM uint32_t CRCINIT;                 /*!< (@ 0x0000053C) CRC initial value                                          */
        __IM uint32_t RESERVED11;
        __IOM uint32_t TIFS;                    /*!< (@ 0x00000544) Interframe spacing in us                                   */
        __IM uint32_t RSSISAMPLE;               /*!< (@ 0x00000548) RSSI sample                                                */
        __IM uint32_t RESERVED12;
        __IM uint32_t STATE;                    /*!< (@ 0x00000550) Current radio state                                        */
        __IOM uint32_t DATAWHITEIV;             /*!< (@ 0x00000554) Data whitening initial value                               */
        __IM uint32_t RESERVED13[ 2 ];
        __IOM uint32_t BCC;                     /*!< (@ 0x00000560) Bit counter compare                                        */
        __IM uint32_t RESERVED14[ 39 ];
        __IOM uint32_t DAB[ 8 ];                /*!< (@ 0x00000600) Description collection: Device address base segment
                                                 *                  n                                                          */
        __IOM uint32_t DAP[ 8 ];                /*!< (@ 0x00000620) Description collection: Device address prefix
                                                 *                  n                                                          */
        __IOM uint32_t DACNF;                   /*!< (@ 0x00000640) Device address match configuration                         */
        __IOM uint32_t MHRMATCHCONF;            /*!< (@ 0x00000644) Search pattern configuration                               */
        __IOM uint32_t MHRMATCHMAS;             /*!< (@ 0x00000648) Pattern mask                                               */
        __IM uint32_t RESERVED15;
        __IOM uint32_t MODECNF0;                /*!< (@ 0x00000650) Radio mode configuration register 0                        */
        __IM uint32_t RESERVED16[ 3 ];
        __IOM uint32_t SFD;                     /*!< (@ 0x00000660) IEEE 802.15.4 start of frame delimiter                     */
        __IOM uint32_t EDCNT;                   /*!< (@ 0x00000664) IEEE 802.15.4 energy detect loop count                     */
        __IM uint32_t EDSAMPLE;                 /*!< (@ 0x00000668) IEEE 802.15.4 energy detect level                          */
        __IOM uint32_t CCACTRL;                 /*!< (@ 0x0000066C) IEEE 802.15.4 clear channel assessment control             */
        __IM uint32_t RESERVED17[ 164 ];
        __IOM uint32_t DFEMODE;                 /*!< (@ 0x00000900) Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure
                                                 *                  (AOD)                                                      */
        __IOM uint32_t CTEINLINECONF;           /*!< (@ 0x00000904) Configuration for CTE inline mode                          */
        __IM uint32_t RESERVED18[ 2 ];
        __IOM uint32_t DFECTRL1;                /*!< (@ 0x00000910) Various configuration for Direction finding                */
        __IOM uint32_t DFECTRL2;                /*!< (@ 0x00000914) Start offset for Direction finding                         */
        __IM uint32_t RESERVED19[ 4 ];
        __IOM uint32_t SWITCHPATTERN;           /*!< (@ 0x00000928) GPIO patterns to be used for each antenna                  */
        __IOM uint32_t CLEARPATTERN;            /*!< (@ 0x0000092C) Clear the GPIO pattern array for antenna control           */
        __IOM RADIO_PSEL_Type PSEL;             /*!< (@ 0x00000930) Unspecified                                                */
        __IOM RADIO_DFEPACKET_Type DFEPACKET;   /*!< (@ 0x00000950) DFE packet EasyDMA channel                                 */
        __IM uint32_t RESERVED20[ 424 ];
        __IOM uint32_t POWER;                   /*!< (@ 0x00000FFC) Peripheral power control                                   */
    } NRF_RADIO_Type;                           /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Universal Asynchronous Receiver/Transmitter (UART0)
 */

    typedef struct                              /*!< (@ 0x40002000) UART0 Structure                                            */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start UART receiver                                        */
        __OM uint32_t TASKS_STOPRX;             /*!< (@ 0x00000004) Stop UART receiver                                         */
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start UART transmitter                                     */
        __OM uint32_t TASKS_STOPTX;             /*!< (@ 0x0000000C) Stop UART transmitter                                      */
        __IM uint32_t RESERVED[ 3 ];
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend UART                                               */
        __IM uint32_t RESERVED1[ 56 ];
        __IOM uint32_t EVENTS_CTS;              /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.                 */
        __IOM uint32_t EVENTS_NCTS;             /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.          */
        __IOM uint32_t EVENTS_RXDRDY;           /*!< (@ 0x00000108) Data received in RXD                                       */
        __IM uint32_t RESERVED2[ 4 ];
        __IOM uint32_t EVENTS_TXDRDY;           /*!< (@ 0x0000011C) Data sent from TXD                                         */
        __IM uint32_t RESERVED3;
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) Error detected                                             */
        __IM uint32_t RESERVED4[ 7 ];
        __IOM uint32_t EVENTS_RXTO;             /*!< (@ 0x00000144) Receiver timeout                                           */
        __IM uint32_t RESERVED5[ 46 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED6[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED7[ 93 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x00000480) Error source                                               */
        __IM uint32_t RESERVED8[ 31 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable UART                                                */
        __IM uint32_t RESERVED9;
        __IOM UART_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RXD;                      /*!< (@ 0x00000518) RXD register                                               */
        __OM uint32_t TXD;                      /*!< (@ 0x0000051C) TXD register                                               */
        __IM uint32_t RESERVED10;
        __IOM uint32_t BAUDRATE;                /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                 *                  selected.                                                  */
        __IM uint32_t RESERVED11[ 17 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x0000056C) Configuration of parity and hardware flow control          */
    } NRF_UART_Type;                            /*!< Size = 1392 (0x570)                                                       */



/* =========================================================================================================================== */
/* ================                                          UARTE0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief UART with EasyDMA (UARTE0)
 */

