FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
    typedef struct                              /*!< (@ 0x40003000) SPIS0 Structure                                            */
    {
        __IM uint32_t RESERVED[ 9 ];
        __OM uint32_t TASKS_ACQUIRE;            /*!< (@ 0x00000024) Acquire SPI semaphore                                      */
        __OM uint32_t TASKS_RELEASE;            /*!< (@ 0x00000028) Release SPI semaphore, enabling the SPI slave
                                                 *                  to acquire it                                              */
        __IM uint32_t RESERVED1[ 54 ];
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x00000104) Granted transaction completed                              */
        __IM uint32_t RESERVED2[ 2 ];
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) End of RXD buffer reached                                  */
        __IM uint32_t RESERVED3[ 5 ];
        __IOM uint32_t EVENTS_ACQUIRED;         /*!< (@ 0x00000128) Semaphore acquired                                         */
        __IM uint32_t RESERVED4[ 53 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED5[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED6[ 61 ];
        __IM uint32_t SEMSTAT;                  /*!< (@ 0x00000400) Semaphore status register                                  */
        __IM uint32_t RESERVED7[ 15 ];
        __IOM uint32_t STATUS;                  /*!< (@ 0x00000440) Status from last transaction                               */
        __IM uint32_t RESERVED8[ 47 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable SPI slave                                           */
        __IM uint32_t RESERVED9;
        __IOM SPIS_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED10[ 7 ];
        __IOM SPIS_RXD_Type RXD;                /*!< (@ 0x00000534) Unspecified                                                */
        __IOM SPIS_TXD_Type TXD;                /*!< (@ 0x00000544) Unspecified                                                */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000554) Configuration register                                     */
        __IM uint32_t RESERVED11;
        __IOM uint32_t DEF;                     /*!< (@ 0x0000055C) Default character. Character clocked out in case
                                                 *                  of an ignored transaction.                                 */
        __IM uint32_t RESERVED12[ 24 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Over-read character                                        */
    } NRF_SPIS_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                           TWI0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Interface 0 (TWI0)
 */

    typedef struct                              /*!< (@ 0x40003000) TWI0 Structure                                             */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start TWI receive sequence                                 */
        __IM uint32_t RESERVED;
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start TWI transmit sequence                                */
        __IM uint32_t RESERVED1[ 2 ];
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop TWI transaction                                       */
        __IM uint32_t RESERVED2;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume TWI transaction                                     */
        __IM uint32_t RESERVED3[ 56 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) TWI stopped                                                */
        __IOM uint32_t EVENTS_RXDREADY;         /*!< (@ 0x00000108) TWI RXD byte received                                      */
        __IM uint32_t RESERVED4[ 4 ];
        __IOM uint32_t EVENTS_TXDSENT;          /*!< (@ 0x0000011C) TWI TXD byte sent                                          */
        __IM uint32_t RESERVED5;
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) TWI error                                                  */
        __IM uint32_t RESERVED6[ 4 ];
        __IOM uint32_t EVENTS_BB;               /*!< (@ 0x00000138) TWI byte boundary, generated before each byte
                                                 *                  that is sent or received                                   */
        __IM uint32_t RESERVED7[ 3 ];
        __IOM uint32_t EVENTS_SUSPENDED;        /*!< (@ 0x00000148) TWI entered the suspended state                            */
        __IM uint32_t RESERVED8[ 45 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED9[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED10[ 110 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x000004C4) Error source                                               */
        __IM uint32_t RESERVED11[ 14 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable TWI                                                 */
        __IM uint32_t RESERVED12;
        __IOM TWI_PSEL_Type PSEL;               /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED13[ 2 ];
        __IM uint32_t RXD;                      /*!< (@ 0x00000518) RXD register                                               */
        __IOM uint32_t TXD;                     /*!< (@ 0x0000051C) TXD register                                               */
        __IM uint32_t RESERVED14;
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED15[ 24 ];
        __IOM uint32_t ADDRESS;                 /*!< (@ 0x00000588) Address used in the TWI transfer                           */
    } NRF_TWI_Type;                             /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                           TWIM0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Master Interface with EasyDMA 0 (TWIM0)
 */

