FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
    typedef struct                              /*!< (@ 0x40006000) GPIOTE Structure                                           */
    {
        __OM uint32_t TASKS_OUT[ 8 ];           /*!< (@ 0x00000000) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is configured in CONFIG[n].POLARITY.                       */
        __IM uint32_t RESERVED[ 4 ];
        __OM uint32_t TASKS_SET[ 8 ];           /*!< (@ 0x00000030) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is to set it high.                                         */
        __IM uint32_t RESERVED1[ 4 ];
        __OM uint32_t TASKS_CLR[ 8 ];           /*!< (@ 0x00000060) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is to set it low.                                          */
        __IM uint32_t RESERVED2[ 32 ];
        __IOM uint32_t EVENTS_IN[ 8 ];          /*!< (@ 0x00000100) Description collection: Event generated from
                                                 *                  pin specified in CONFIG[n].PSEL                            */
        __IM uint32_t RESERVED3[ 23 ];
        __IOM uint32_t EVENTS_PORT;             /*!< (@ 0x0000017C) Event generated from multiple input GPIO pins
                                                 *                  with SENSE mechanism enabled                               */
        __IM uint32_t RESERVED4[ 97 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED5[ 129 ];
        __IOM uint32_t CONFIG[ 8 ];             /*!< (@ 0x00000510) Description collection: Configuration for OUT[n],
                                                 *                  SET[n], and CLR[n] tasks and IN[n] event                   */
    } NRF_GPIOTE_Type;                          /*!< Size = 1328 (0x530)                                                       */



/* =========================================================================================================================== */
/* ================                                          TIMER0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Timer/Counter 0 (TIMER0)
 */

    typedef struct                              /*!< (@ 0x40008000) TIMER0 Structure                                           */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start Timer                                                */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop Timer                                                 */
        __OM uint32_t TASKS_COUNT;              /*!< (@ 0x00000008) Increment Timer (Counter mode only)                        */
        __OM uint32_t TASKS_CLEAR;              /*!< (@ 0x0000000C) Clear time                                                 */
        __OM uint32_t TASKS_SHUTDOWN;           /*!< (@ 0x00000010) Deprecated register - Shut down timer                      */
        __IM uint32_t RESERVED[ 11 ];
        __OM uint32_t TASKS_CAPTURE[ 6 ];       /*!< (@ 0x00000040) Description collection: Capture Timer value to
                                                 *                  CC[n] register                                             */
        __IM uint32_t RESERVED1[ 58 ];
        __IOM uint32_t EVENTS_COMPARE[ 6 ];     /*!< (@ 0x00000140) Description collection: Compare event on CC[n]
                                                 *                  match                                                      */
        __IM uint32_t RESERVED2[ 42 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED3[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 126 ];
        __IOM uint32_t MODE;                    /*!< (@ 0x00000504) Timer mode selection                                       */
        __IOM uint32_t BITMODE;                 /*!< (@ 0x00000508) Configure the number of bits used by the TIMER             */
        __IM uint32_t RESERVED5;
        __IOM uint32_t PRESCALER;               /*!< (@ 0x00000510) Timer prescaler register                                   */
        __IM uint32_t RESERVED6[ 11 ];
        __IOM uint32_t CC[ 6 ];                 /*!< (@ 0x00000540) Description collection: Capture/Compare register
                                                 *                  n                                                          */
    } NRF_TIMER_Type;                           /*!< Size = 1368 (0x558)                                                       */



/* =========================================================================================================================== */
/* ================                                           RTC0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Real time counter 0 (RTC0)
 */

