FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
    typedef struct                              /*!< (@ 0x40010000) WDT Structure                                              */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start the watchdog                                         */
        __IM uint32_t RESERVED[ 63 ];
        __IOM uint32_t EVENTS_TIMEOUT;          /*!< (@ 0x00000100) Watchdog timeout                                           */
        __IM uint32_t RESERVED1[ 128 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED2[ 61 ];
        __IM uint32_t RUNSTATUS;                /*!< (@ 0x00000400) Run status                                                 */
        __IM uint32_t REQSTATUS;                /*!< (@ 0x00000404) Request status                                             */
        __IM uint32_t RESERVED3[ 63 ];
        __IOM uint32_t CRV;                     /*!< (@ 0x00000504) Counter reload value                                       */
        __IOM uint32_t RREN;                    /*!< (@ 0x00000508) Enable register for reload request registers               */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x0000050C) Configuration register                                     */
        __IM uint32_t RESERVED4[ 60 ];
        __OM uint32_t RR[ 8 ];                  /*!< (@ 0x00000600) Description collection: Reload request n                   */
    } NRF_WDT_Type;                             /*!< Size = 1568 (0x620)                                                       */



/* =========================================================================================================================== */
/* ================                                           QDEC                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Quadrature Decoder (QDEC)
 */

    typedef struct                              /*!< (@ 0x40012000) QDEC Structure                                             */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Task starting the quadrature decoder                       */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Task stopping the quadrature decoder                       */
        __OM uint32_t TASKS_READCLRACC;         /*!< (@ 0x00000008) Read and clear ACC and ACCDBL                              */
        __OM uint32_t TASKS_RDCLRACC;           /*!< (@ 0x0000000C) Read and clear ACC                                         */
        __OM uint32_t TASKS_RDCLRDBL;           /*!< (@ 0x00000010) Read and clear ACCDBL                                      */
        __IM uint32_t RESERVED[ 59 ];
        __IOM uint32_t EVENTS_SAMPLERDY;        /*!< (@ 0x00000100) Event being generated for every new sample value
                                                 *                  written to the SAMPLE register                             */
        __IOM uint32_t EVENTS_REPORTRDY;        /*!< (@ 0x00000104) Non-null report ready                                      */
        __IOM uint32_t EVENTS_ACCOF;            /*!< (@ 0x00000108) ACC or ACCDBL register overflow                            */
        __IOM uint32_t EVENTS_DBLRDY;           /*!< (@ 0x0000010C) Double displacement(s) detected                            */
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000110) QDEC has been stopped                                      */
        __IM uint32_t RESERVED1[ 59 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED2[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED3[ 125 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable the quadrature decoder                              */
        __IOM uint32_t LEDPOL;                  /*!< (@ 0x00000504) LED output pin polarity                                    */
        __IOM uint32_t SAMPLEPER;               /*!< (@ 0x00000508) Sample period                                              */
        __IM int32_t SAMPLE;                    /*!< (@ 0x0000050C) Motion sample value                                        */
        __IOM uint32_t REPORTPER;               /*!< (@ 0x00000510) Number of samples to be taken before REPORTRDY
                                                 *                  and DBLRDY events can be generated                         */
        __IM int32_t ACC;                       /*!< (@ 0x00000514) Register accumulating the valid transitions                */
        __IM int32_t ACCREAD;                   /*!< (@ 0x00000518) Snapshot of the ACC register, updated by the
                                                 *                  READCLRACC or RDCLRACC task                                */
        __IOM QDEC_PSEL_Type PSEL;              /*!< (@ 0x0000051C) Unspecified                                                */
        __IOM uint32_t DBFEN;                   /*!< (@ 0x00000528) Enable input debounce filters                              */
        __IM uint32_t RESERVED4[ 5 ];
        __IOM uint32_t LEDPRE;                  /*!< (@ 0x00000540) Time period the LED is switched ON prior to sampling       */
        __IM uint32_t ACCDBL;                   /*!< (@ 0x00000544) Register accumulating the number of detected
                                                 *                  double transitions                                         */
        __IM uint32_t ACCDBLREAD;               /*!< (@ 0x00000548) Snapshot of the ACCDBL, updated by the READCLRACC
                                                 *                  or RDCLRDBL task                                           */
    } NRF_QDEC_Type;                            /*!< Size = 1356 (0x54c)                                                       */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Comparator (COMP)
 */

    typedef struct                              /*!< (@ 0x40013000) COMP Structure                                             */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start comparator                                           */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop comparator                                            */
        __OM uint32_t TASKS_SAMPLE;             /*!< (@ 0x00000008) Sample comparator value                                    */
        __IM uint32_t RESERVED[ 61 ];
        __IOM uint32_t EVENTS_READY;            /*!< (@ 0x00000100) COMP is ready and output is valid                          */
        __IOM uint32_t EVENTS_DOWN;             /*!< (@ 0x00000104) Downward crossing                                          */
        __IOM uint32_t EVENTS_UP;               /*!< (@ 0x00000108) Upward crossing                                            */
        __IOM uint32_t EVENTS_CROSS;            /*!< (@ 0x0000010C) Downward or upward crossing                                */
        __IM uint32_t RESERVED1[ 60 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED2[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED3[ 61 ];
        __IM uint32_t RESULT;                   /*!< (@ 0x00000400) Compare result                                             */
        __IM uint32_t RESERVED4[ 63 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) COMP enable                                                */
        __IOM uint32_t PSEL;                    /*!< (@ 0x00000504) Pin select                                                 */
        __IOM uint32_t REFSEL;                  /*!< (@ 0x00000508) Reference source select for single-ended mode              */
        __IOM uint32_t EXTREFSEL;               /*!< (@ 0x0000050C) External reference select                                  */
        __IM uint32_t RESERVED5[ 8 ];
        __IOM uint32_t TH;                      /*!< (@ 0x00000530) Threshold configuration for hysteresis unit                */
        __IOM uint32_t MODE;                    /*!< (@ 0x00000534) Mode configuration                                         */
        __IOM uint32_t HYST;                    /*!< (@ 0x00000538) Comparator hysteresis enable                               */
    } NRF_COMP_Type;                            /*!< Size = 1340 (0x53c)                                                       */



/* =========================================================================================================================== */
/* ================                                           EGU0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Event generator unit 0 (EGU0)
 */

