FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
    typedef struct                              /*!< (@ 0x40014000) EGU0 Structure                                             */
    {
        __OM uint32_t TASKS_TRIGGER[ 16 ];      /*!< (@ 0x00000000) Description collection: Trigger n for triggering
                                                 *                  the corresponding TRIGGERED[n] event                       */
        __IM uint32_t RESERVED[ 48 ];
        __IOM uint32_t EVENTS_TRIGGERED[ 16 ];  /*!< (@ 0x00000100) Description collection: Event number n generated
                                                 *                  by triggering the corresponding TRIGGER[n]
                                                 *                  task                                                       */
        __IM uint32_t RESERVED1[ 112 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
    } NRF_EGU_Type;                             /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                           SWI0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Software interrupt 0 (SWI0)
 */

    typedef struct                              /*!< (@ 0x40014000) SWI0 Structure                                             */
    {
        __IM uint32_t UNUSED;                   /*!< (@ 0x00000000) Unused.                                                    */
    } NRF_SWI_Type;                             /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            ACL                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Access control lists (ACL)
 */

    typedef struct                              /*!< (@ 0x4001E000) ACL Structure                                              */
    {
        __IM uint32_t RESERVED[ 512 ];
        __IOM ACL_ACL_Type ACL[ 8 ];            /*!< (@ 0x00000800) Unspecified                                                */
    } NRF_ACL_Type;                             /*!< Size = 2176 (0x880)                                                       */



/* =========================================================================================================================== */
/* ================                                           NVMC                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Non Volatile Memory Controller (NVMC)
 */

    typedef struct                              /*!< (@ 0x4001E000) NVMC Structure                                             */
    {
        __IM uint32_t RESERVED[ 256 ];
        __IM uint32_t READY;                    /*!< (@ 0x00000400) Ready flag                                                 */
        __IM uint32_t RESERVED1;
        __IM uint32_t READYNEXT;                /*!< (@ 0x00000408) Ready flag                                                 */
        __IM uint32_t RESERVED2[ 62 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000504) Configuration register                                     */

        union
        {
            __OM uint32_t ERASEPAGE;            /*!< (@ 0x00000508) Register for erasing a page in code area                   */
            __OM uint32_t ERASEPCR1;            /*!< (@ 0x00000508) Deprecated register - Register for erasing a
                                                 *                  page in code area, equivalent to ERASEPAGE                 */
        };
        __OM uint32_t ERASEALL;                 /*!< (@ 0x0000050C) Register for erasing all non-volatile user memory          */
        __OM uint32_t ERASEPCR0;                /*!< (@ 0x00000510) Deprecated register - Register for erasing a
                                                 *                  page in code area, equivalent to ERASEPAGE                 */
        __OM uint32_t ERASEUICR;                /*!< (@ 0x00000514) Register for erasing user information configuration
                                                 *                  registers                                                  */
        __OM uint32_t ERASEPAGEPARTIAL;         /*!< (@ 0x00000518) Register for partial erase of a page in code
                                                 *                  area                                                       */
        __IOM uint32_t ERASEPAGEPARTIALCFG;     /*!< (@ 0x0000051C) Register for partial erase configuration                   */
    } NRF_NVMC_Type;                            /*!< Size = 1312 (0x520)                                                       */



/* =========================================================================================================================== */
/* ================                                            PPI                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Programmable Peripheral Interconnect (PPI)
 */

    typedef struct                              /*!< (@ 0x4001F000) PPI Structure                                              */
    {
        __OM PPI_TASKS_CHG_Type TASKS_CHG[ 6 ]; /*!< (@ 0x00000000) Channel group tasks                                        */
        __IM uint32_t RESERVED[ 308 ];
        __IOM uint32_t CHEN;                    /*!< (@ 0x00000500) Channel enable register                                    */
        __IOM uint32_t CHENSET;                 /*!< (@ 0x00000504) Channel enable set register                                */
        __IOM uint32_t CHENCLR;                 /*!< (@ 0x00000508) Channel enable clear register                              */
        __IM uint32_t RESERVED1;
        __IOM PPI_CH_Type CH[ 20 ];             /*!< (@ 0x00000510) PPI Channel                                                */
        __IM uint32_t RESERVED2[ 148 ];
        __IOM uint32_t CHG[ 6 ];                /*!< (@ 0x00000800) Description collection: Channel group n                    */
        __IM uint32_t RESERVED3[ 62 ];
        __IOM PPI_FORK_Type FORK[ 32 ];         /*!< (@ 0x00000910) Fork                                                       */
    } NRF_PPI_Type;                             /*!< Size = 2448 (0x990)                                                       */



/* =========================================================================================================================== */
/* ================                                           USBD                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Universal serial bus device (USBD)
 */

    typedef struct                              /*!< (@ 0x40027000) USBD Structure                                             */
    {
        __IM uint32_t RESERVED;
        __OM uint32_t TASKS_STARTEPIN[ 8 ];     /*!< (@ 0x00000004) Description collection: Captures the EPIN[n].PTR
                                                 *                  and EPIN[n].MAXCNT registers values, and
                                                 *                  enables endpoint IN n to respond to traffic
                                                 *                  from host                                                  */
        __OM uint32_t TASKS_STARTISOIN;         /*!< (@ 0x00000024) Captures the ISOIN.PTR and ISOIN.MAXCNT registers
                                                 *                  values, and enables sending data on ISO
                                                 *                  endpoint                                                   */
        __OM uint32_t TASKS_STARTEPOUT[ 8 ];    /*!< (@ 0x00000028) Description collection: Captures the EPOUT[n].PTR
                                                 *                  and EPOUT[n].MAXCNT registers values, and
                                                 *                  enables endpoint n to respond to traffic
                                                 *                  from host                                                  */
        __OM uint32_t TASKS_STARTISOOUT;        /*!< (@ 0x00000048) Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers
                                                 *                  values, and enables receiving of data on
                                                 *                  ISO endpoint                                               */
        __OM uint32_t TASKS_EP0RCVOUT;          /*!< (@ 0x0000004C) Allows OUT data stage on control endpoint 0                */
        __OM uint32_t TASKS_EP0STATUS;          /*!< (@ 0x00000050) Allows status stage on control endpoint 0                  */
        __OM uint32_t TASKS_EP0STALL;           /*!< (@ 0x00000054) Stalls data and status stage on control endpoint
                                                 *                  0                                                          */
        __OM uint32_t TASKS_DPDMDRIVE;          /*!< (@ 0x00000058) Forces D+ and D- lines into the state defined
                                                 *                  in the DPDMVALUE register                                  */
        __OM uint32_t TASKS_DPDMNODRIVE;        /*!< (@ 0x0000005C) Stops forcing D+ and D- lines into any state
                                                 *                  (USB engine takes control)                                 */
        __IM uint32_t RESERVED1[ 40 ];
        __IOM uint32_t EVENTS_USBRESET;         /*!< (@ 0x00000100) Signals that a USB reset condition has been detected
                                                 *                  on USB lines                                               */
        __IOM uint32_t EVENTS_STARTED;          /*!< (@ 0x00000104) Confirms that the EPIN[n].PTR and EPIN[n].MAXCNT,
                                                 *                  or EPOUT[n].PTR and EPOUT[n].MAXCNT registers
                                                 *                  have been captured on all endpoints reported
                                                 *                  in the EPSTATUS register                                   */
        __IOM uint32_t EVENTS_ENDEPIN[ 8 ];     /*!< (@ 0x00000108) Description collection: The whole EPIN[n] buffer
                                                 *                  has been consumed. The buffer can be accessed
                                                 *                  safely by software.                                        */
        __IOM uint32_t EVENTS_EP0DATADONE;      /*!< (@ 0x00000128) An acknowledged data transfer has taken place
                                                 *                  on the control endpoint                                    */
        __IOM uint32_t EVENTS_ENDISOIN;         /*!< (@ 0x0000012C) The whole ISOIN buffer has been consumed. The
                                                 *                  buffer can be accessed safely by software.                 */
        __IOM uint32_t EVENTS_ENDEPOUT[ 8 ];    /*!< (@ 0x00000130) Description collection: The whole EPOUT[n] buffer
                                                 *                  has been consumed. The buffer can be accessed
                                                 *                  safely by software.                                        */
        __IOM uint32_t EVENTS_ENDISOOUT;        /*!< (@ 0x00000150) The whole ISOOUT buffer has been consumed. The
                                                 *                  buffer can be accessed safely by software.                 */
        __IOM uint32_t EVENTS_SOF;              /*!< (@ 0x00000154) Signals that a SOF (start of frame) condition
                                                 *                  has been detected on USB lines                             */
        __IOM uint32_t EVENTS_USBEVENT;         /*!< (@ 0x00000158) An event or an error not covered by specific
                                                 *                  events has occurred. Check EVENTCAUSE register
                                                 *                  to find the cause.                                         */
        __IOM uint32_t EVENTS_EP0SETUP;         /*!< (@ 0x0000015C) A valid SETUP token has been received (and acknowledged)
                                                 *                  on the control endpoint                                    */
        __IOM uint32_t EVENTS_EPDATA;           /*!< (@ 0x00000160) A data transfer has occurred on a data endpoint,
                                                 *                  indicated by the EPDATASTATUS register                     */
        __IM uint32_t RESERVED2[ 39 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED3[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 61 ];
        __IOM uint32_t EVENTCAUSE;              /*!< (@ 0x00000400) Details on what caused the USBEVENT event                  */
        __IM uint32_t RESERVED5[ 7 ];
        __IOM USBD_HALTED_Type HALTED;          /*!< (@ 0x00000420) Unspecified                                                */
        __IM uint32_t RESERVED6;
        __IOM uint32_t EPSTATUS;                /*!< (@ 0x00000468) Provides information on which endpoint's EasyDMA
                                                 *                  registers have been captured                               */
        __IOM uint32_t EPDATASTATUS;            /*!< (@ 0x0000046C) Provides information on which endpoint(s) an
                                                 *                  acknowledged data transfer has occurred
                                                 *                  (EPDATA event)                                             */
        __IM uint32_t USBADDR;                  /*!< (@ 0x00000470) Device USB address                                         */
        __IM uint32_t RESERVED7[ 3 ];
        __IM uint32_t BMREQUESTTYPE;            /*!< (@ 0x00000480) SETUP data, byte 0, bmRequestType                          */
        __IM uint32_t BREQUEST;                 /*!< (@ 0x00000484) SETUP data, byte 1, bRequest                               */
        __IM uint32_t WVALUEL;                  /*!< (@ 0x00000488) SETUP data, byte 2, LSB of wValue                          */
        __IM uint32_t WVALUEH;                  /*!< (@ 0x0000048C) SETUP data, byte 3, MSB of wValue                          */
        __IM uint32_t WINDEXL;                  /*!< (@ 0x00000490) SETUP data, byte 4, LSB of wIndex                          */
        __IM uint32_t WINDEXH;                  /*!< (@ 0x00000494) SETUP data, byte 5, MSB of wIndex                          */
        __IM uint32_t WLENGTHL;                 /*!< (@ 0x00000498) SETUP data, byte 6, LSB of wLength                         */
        __IM uint32_t WLENGTHH;                 /*!< (@ 0x0000049C) SETUP data, byte 7, MSB of wLength                         */
        __IOM USBD_SIZE_Type SIZE;              /*!< (@ 0x000004A0) Unspecified                                                */
        __IM uint32_t RESERVED8[ 15 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable USB                                                 */
        __IOM uint32_t USBPULLUP;               /*!< (@ 0x00000504) Control of the USB pull-up                                 */
        __IOM uint32_t DPDMVALUE;               /*!< (@ 0x00000508) State D+ and D- lines will be forced into by
                                                 *                  the DPDMDRIVE task. The DPDMNODRIVE task
                                                 *                  reverts the control of the lines to MAC
                                                 *                  IP (no forcing).                                           */
        __IOM uint32_t DTOGGLE;                 /*!< (@ 0x0000050C) Data toggle control and status                             */
        __IOM uint32_t EPINEN;                  /*!< (@ 0x00000510) Endpoint IN enable                                         */
        __IOM uint32_t EPOUTEN;                 /*!< (@ 0x00000514) Endpoint OUT enable                                        */
        __OM uint32_t EPSTALL;                  /*!< (@ 0x00000518) STALL endpoints                                            */
        __IOM uint32_t ISOSPLIT;                /*!< (@ 0x0000051C) Controls the split of ISO buffers                          */
        __IM uint32_t FRAMECNTR;                /*!< (@ 0x00000520) Returns the current value of the start of frame
                                                 *                  counter                                                    */
        __IM uint32_t RESERVED9[ 2 ];
        __IOM uint32_t LOWPOWER;                /*!< (@ 0x0000052C) Controls USBD peripheral low power mode during
                                                 *                  USB suspend                                                */
        __IOM uint32_t ISOINCONFIG;             /*!< (@ 0x00000530) Controls the response of the ISO IN endpoint
                                                 *                  to an IN token when no data is ready to
                                                 *                  be sent                                                    */
        __IM uint32_t RESERVED10[ 51 ];
        __IOM USBD_EPIN_Type EPIN[ 8 ];         /*!< (@ 0x00000600) Unspecified                                                */
        __IOM USBD_ISOIN_Type ISOIN;            /*!< (@ 0x000006A0) Unspecified                                                */
        __IM uint32_t RESERVED11[ 21 ];
        __IOM USBD_EPOUT_Type EPOUT[ 8 ];       /*!< (@ 0x00000700) Unspecified                                                */
        __IOM USBD_ISOOUT_Type ISOOUT;          /*!< (@ 0x000007A0) Unspecified                                                */
    } NRF_USBD_Type;                            /*!< Size = 1964 (0x7ac)                                                       */


