FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

    #define NRF_FICR_BASE         0x10000000UL
    #define NRF_UICR_BASE         0x10001000UL
    #define NRF_APPROTECT_BASE    0x40000000UL
    #define NRF_CLOCK_BASE        0x40000000UL
    #define NRF_POWER_BASE        0x40000000UL
    #define NRF_P0_BASE           0x50000000UL
    #define NRF_RADIO_BASE        0x40001000UL
    #define NRF_UART0_BASE        0x40002000UL
    #define NRF_UARTE0_BASE       0x40002000UL
    #define NRF_SPI0_BASE         0x40003000UL
    #define NRF_SPIM0_BASE        0x40003000UL
    #define NRF_SPIS0_BASE        0x40003000UL
    #define NRF_TWI0_BASE         0x40003000UL
    #define NRF_TWIM0_BASE        0x40003000UL
    #define NRF_TWIS0_BASE        0x40003000UL
    #define NRF_SPI1_BASE         0x40004000UL
    #define NRF_SPIM1_BASE        0x40004000UL
    #define NRF_SPIS1_BASE        0x40004000UL
    #define NRF_TWI1_BASE         0x40004000UL
    #define NRF_TWIM1_BASE        0x40004000UL
    #define NRF_TWIS1_BASE        0x40004000UL
    #define NRF_GPIOTE_BASE       0x40006000UL
    #define NRF_TIMER0_BASE       0x40008000UL
    #define NRF_TIMER1_BASE       0x40009000UL
    #define NRF_TIMER2_BASE       0x4000A000UL
    #define NRF_RTC0_BASE         0x4000B000UL
    #define NRF_TEMP_BASE         0x4000C000UL
    #define NRF_RNG_BASE          0x4000D000UL
    #define NRF_ECB_BASE          0x4000E000UL
    #define NRF_AAR_BASE          0x4000F000UL
    #define NRF_CCM_BASE          0x4000F000UL
    #define NRF_WDT_BASE          0x40010000UL
    #define NRF_RTC1_BASE         0x40011000UL
    #define NRF_QDEC_BASE         0x40012000UL
    #define NRF_COMP_BASE         0x40013000UL
    #define NRF_EGU0_BASE         0x40014000UL
    #define NRF_SWI0_BASE         0x40014000UL
    #define NRF_EGU1_BASE         0x40015000UL
    #define NRF_SWI1_BASE         0x40015000UL
    #define NRF_EGU2_BASE         0x40016000UL
    #define NRF_SWI2_BASE         0x40016000UL
    #define NRF_EGU3_BASE         0x40017000UL
    #define NRF_SWI3_BASE         0x40017000UL
    #define NRF_EGU4_BASE         0x40018000UL
    #define NRF_SWI4_BASE         0x40018000UL
    #define NRF_EGU5_BASE         0x40019000UL
    #define NRF_SWI5_BASE         0x40019000UL
    #define NRF_TIMER3_BASE       0x4001A000UL
    #define NRF_ACL_BASE          0x4001E000UL
    #define NRF_NVMC_BASE         0x4001E000UL
    #define NRF_PPI_BASE          0x4001F000UL
    #define NRF_USBD_BASE         0x40027000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
 * @{
 */

    #define NRF_FICR         ( ( NRF_FICR_Type * ) NRF_FICR_BASE )
    #define NRF_UICR         ( ( NRF_UICR_Type * ) NRF_UICR_BASE )
    #define NRF_APPROTECT    ( ( NRF_APPROTECT_Type * ) NRF_APPROTECT_BASE )
    #define NRF_CLOCK        ( ( NRF_CLOCK_Type * ) NRF_CLOCK_BASE )
    #define NRF_POWER        ( ( NRF_POWER_Type * ) NRF_POWER_BASE )
    #define NRF_P0           ( ( NRF_GPIO_Type * ) NRF_P0_BASE )
    #define NRF_RADIO        ( ( NRF_RADIO_Type * ) NRF_RADIO_BASE )
    #define NRF_UART0        ( ( NRF_UART_Type * ) NRF_UART0_BASE )
    #define NRF_UARTE0       ( ( NRF_UARTE_Type * ) NRF_UARTE0_BASE )
    #define NRF_SPI0         ( ( NRF_SPI_Type * ) NRF_SPI0_BASE )
    #define NRF_SPIM0        ( ( NRF_SPIM_Type * ) NRF_SPIM0_BASE )
    #define NRF_SPIS0        ( ( NRF_SPIS_Type * ) NRF_SPIS0_BASE )
    #define NRF_TWI0         ( ( NRF_TWI_Type * ) NRF_TWI0_BASE )
    #define NRF_TWIM0        ( ( NRF_TWIM_Type * ) NRF_TWIM0_BASE )
    #define NRF_TWIS0        ( ( NRF_TWIS_Type * ) NRF_TWIS0_BASE )
    #define NRF_SPI1         ( ( NRF_SPI_Type * ) NRF_SPI1_BASE )
    #define NRF_SPIM1        ( ( NRF_SPIM_Type * ) NRF_SPIM1_BASE )
    #define NRF_SPIS1        ( ( NRF_SPIS_Type * ) NRF_SPIS1_BASE )
    #define NRF_TWI1         ( ( NRF_TWI_Type * ) NRF_TWI1_BASE )
    #define NRF_TWIM1        ( ( NRF_TWIM_Type * ) NRF_TWIM1_BASE )
    #define NRF_TWIS1        ( ( NRF_TWIS_Type * ) NRF_TWIS1_BASE )
    #define NRF_GPIOTE       ( ( NRF_GPIOTE_Type * ) NRF_GPIOTE_BASE )
    #define NRF_TIMER0       ( ( NRF_TIMER_Type * ) NRF_TIMER0_BASE )
    #define NRF_TIMER1       ( ( NRF_TIMER_Type * ) NRF_TIMER1_BASE )
    #define NRF_TIMER2       ( ( NRF_TIMER_Type * ) NRF_TIMER2_BASE )
    #define NRF_RTC0         ( ( NRF_RTC_Type * ) NRF_RTC0_BASE )
    #define NRF_TEMP         ( ( NRF_TEMP_Type * ) NRF_TEMP_BASE )
    #define NRF_RNG          ( ( NRF_RNG_Type * ) NRF_RNG_BASE )
    #define NRF_ECB          ( ( NRF_ECB_Type * ) NRF_ECB_BASE )
    #define NRF_AAR          ( ( NRF_AAR_Type * ) NRF_AAR_BASE )
    #define NRF_CCM          ( ( NRF_CCM_Type * ) NRF_CCM_BASE )
    #define NRF_WDT          ( ( NRF_WDT_Type * ) NRF_WDT_BASE )
    #define NRF_RTC1         ( ( NRF_RTC_Type * ) NRF_RTC1_BASE )
    #define NRF_QDEC         ( ( NRF_QDEC_Type * ) NRF_QDEC_BASE )
    #define NRF_COMP         ( ( NRF_COMP_Type * ) NRF_COMP_BASE )
    #define NRF_EGU0         ( ( NRF_EGU_Type * ) NRF_EGU0_BASE )
    #define NRF_SWI0         ( ( NRF_SWI_Type * ) NRF_SWI0_BASE )
    #define NRF_EGU1         ( ( NRF_EGU_Type * ) NRF_EGU1_BASE )
    #define NRF_SWI1         ( ( NRF_SWI_Type * ) NRF_SWI1_BASE )
    #define NRF_EGU2         ( ( NRF_EGU_Type * ) NRF_EGU2_BASE )
    #define NRF_SWI2         ( ( NRF_SWI_Type * ) NRF_SWI2_BASE )
    #define NRF_EGU3         ( ( NRF_EGU_Type * ) NRF_EGU3_BASE )
    #define NRF_SWI3         ( ( NRF_SWI_Type * ) NRF_SWI3_BASE )
    #define NRF_EGU4         ( ( NRF_EGU_Type * ) NRF_EGU4_BASE )
    #define NRF_SWI4         ( ( NRF_SWI_Type * ) NRF_SWI4_BASE )
    #define NRF_EGU5         ( ( NRF_EGU_Type * ) NRF_EGU5_BASE )
    #define NRF_SWI5         ( ( NRF_SWI_Type * ) NRF_SWI5_BASE )
    #define NRF_TIMER3       ( ( NRF_TIMER_Type * ) NRF_TIMER3_BASE )
    #define NRF_ACL          ( ( NRF_ACL_Type * ) NRF_ACL_BASE )
    #define NRF_NVMC         ( ( NRF_NVMC_Type * ) NRF_NVMC_BASE )
    #define NRF_PPI          ( ( NRF_PPI_Type * ) NRF_PPI_BASE )
    #define NRF_USBD         ( ( NRF_USBD_Type * ) NRF_USBD_BASE )

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
    #if defined( __CC_ARM )
        #pragma pop
    #elif defined( __ICCARM__ )
        /* leave anonymous unions enabled */
    #elif defined( __ARMCC_VERSION ) && ( __ARMCC_VERSION >= 6010050 )
        #pragma clang diagnostic pop
    #elif defined( __GNUC__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TMS470__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TASKING__ )
        #pragma warning restore
    #elif defined( __CSMC__ )
        /* anonymous unions are enabled by default */
    #endif /* if defined( __CC_ARM ) */


    #ifdef __cplusplus
}
    #endif

#endif /* NRF52820_H */


/** @} */ /* End of group nrf52820 */

/** @} */ /* End of group Nordic Semiconductor */
